GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.inc
// Register: SCANTRIG
#define SCANTRIG SCANTRIG
SCANTRIG                                 equ 0397Dh
// bitfield definitions
SCANTRIG_TSEL_POSN                       equ 0000h
SCANTRIG_TSEL_POSITION                   equ 0000h
SCANTRIG_TSEL_SIZE                       equ 0004h
SCANTRIG_TSEL_LENGTH                     equ 0004h
SCANTRIG_TSEL_MASK                       equ 000Fh

// Register: IPR0
#define IPR0 IPR0
IPR0                                     equ 03980h
// bitfield definitions
IPR0_SWIP_POSN                           equ 0000h
IPR0_SWIP_POSITION                       equ 0000h
IPR0_SWIP_SIZE                           equ 0001h
IPR0_SWIP_LENGTH                         equ 0001h
IPR0_SWIP_MASK                           equ 0001h
IPR0_HLVDIP_POSN                         equ 0001h
IPR0_HLVDIP_POSITION                     equ 0001h
IPR0_HLVDIP_SIZE                         equ 0001h
IPR0_HLVDIP_LENGTH                       equ 0001h
IPR0_HLVDIP_MASK                         equ 0002h
IPR0_OSFIP_POSN                          equ 0002h
IPR0_OSFIP_POSITION                      equ 0002h
IPR0_OSFIP_SIZE                          equ 0001h
IPR0_OSFIP_LENGTH                        equ 0001h
IPR0_OSFIP_MASK                          equ 0004h
IPR0_CSWIP_POSN                          equ 0003h
IPR0_CSWIP_POSITION                      equ 0003h
IPR0_CSWIP_SIZE                          equ 0001h
IPR0_CSWIP_LENGTH                        equ 0001h
IPR0_CSWIP_MASK                          equ 0008h
IPR0_NVMIP_POSN                          equ 0004h
IPR0_NVMIP_POSITION                      equ 0004h
IPR0_NVMIP_SIZE                          equ 0001h
IPR0_NVMIP_LENGTH                        equ 0001h
IPR0_NVMIP_MASK                          equ 0010h
IPR0_SCANIP_POSN                         equ 0005h
IPR0_SCANIP_POSITION                     equ 0005h
IPR0_SCANIP_SIZE                         equ 0001h
IPR0_SCANIP_LENGTH                       equ 0001h
IPR0_SCANIP_MASK                         equ 0020h
IPR0_CRCIP_POSN                          equ 0006h
IPR0_CRCIP_POSITION                      equ 0006h
IPR0_CRCIP_SIZE                          equ 0001h
IPR0_CRCIP_LENGTH                        equ 0001h
IPR0_CRCIP_MASK                          equ 0040h
IPR0_IOCIP_POSN                          equ 0007h
IPR0_IOCIP_POSITION                      equ 0007h
IPR0_IOCIP_SIZE                          equ 0001h
IPR0_IOCIP_LENGTH                        equ 0001h
IPR0_IOCIP_MASK                          equ 0080h

// Register: IPR1
#define IPR1 IPR1
IPR1                                     equ 03981h
// bitfield definitions
IPR1_INT0IP_POSN                         equ 0000h
IPR1_INT0IP_POSITION                     equ 0000h
IPR1_INT0IP_SIZE                         equ 0001h
IPR1_INT0IP_LENGTH                       equ 0001h
IPR1_INT0IP_MASK                         equ 0001h
IPR1_ZCDIP_POSN                          equ 0001h
IPR1_ZCDIP_POSITION                      equ 0001h
IPR1_ZCDIP_SIZE                          equ 0001h
IPR1_ZCDIP_LENGTH                        equ 0001h
IPR1_ZCDIP_MASK                          equ 0002h
IPR1_ADIP_POSN                           equ 0002h
IPR1_ADIP_POSITION                       equ 0002h
IPR1_ADIP_SIZE                           equ 0001h
IPR1_ADIP_LENGTH                         equ 0001h
IPR1_ADIP_MASK                           equ 0004h
IPR1_ADTIP_POSN                          equ 0003h
IPR1_ADTIP_POSITION                      equ 0003h
IPR1_ADTIP_SIZE                          equ 0001h
IPR1_ADTIP_LENGTH                        equ 0001h
IPR1_ADTIP_MASK                          equ 0008h
IPR1_C1IP_POSN                           equ 0004h
IPR1_C1IP_POSITION                       equ 0004h
IPR1_C1IP_SIZE                           equ 0001h
IPR1_C1IP_LENGTH                         equ 0001h
IPR1_C1IP_MASK                           equ 0010h
IPR1_SMT1IP_POSN                         equ 0005h
IPR1_SMT1IP_POSITION                     equ 0005h
IPR1_SMT1IP_SIZE                         equ 0001h
IPR1_SMT1IP_LENGTH                       equ 0001h
IPR1_SMT1IP_MASK                         equ 0020h
IPR1_SMT1PRAIP_POSN                      equ 0006h
IPR1_SMT1PRAIP_POSITION                  equ 0006h
IPR1_SMT1PRAIP_SIZE                      equ 0001h
IPR1_SMT1PRAIP_LENGTH                    equ 0001h
IPR1_SMT1PRAIP_MASK                      equ 0040h
IPR1_SMT1PWAIP_POSN                      equ 0007h
IPR1_SMT1PWAIP_POSITION                  equ 0007h
IPR1_SMT1PWAIP_SIZE                      equ 0001h
IPR1_SMT1PWAIP_LENGTH                    equ 0001h
IPR1_SMT1PWAIP_MASK                      equ 0080h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 03982h
// bitfield definitions
IPR2_DMA1SCNTIP_POSN                     equ 0000h
IPR2_DMA1SCNTIP_POSITION                 equ 0000h
IPR2_DMA1SCNTIP_SIZE                     equ 0001h
IPR2_DMA1SCNTIP_LENGTH                   equ 0001h
IPR2_DMA1SCNTIP_MASK                     equ 0001h
IPR2_DMA1DCNTIP_POSN                     equ 0001h
IPR2_DMA1DCNTIP_POSITION                 equ 0001h
IPR2_DMA1DCNTIP_SIZE                     equ 0001h
IPR2_DMA1DCNTIP_LENGTH                   equ 0001h
IPR2_DMA1DCNTIP_MASK                     equ 0002h
IPR2_DMA1ORIP_POSN                       equ 0002h
IPR2_DMA1ORIP_POSITION                   equ 0002h
IPR2_DMA1ORIP_SIZE                       equ 0001h
IPR2_DMA1ORIP_LENGTH                     equ 0001h
IPR2_DMA1ORIP_MASK                       equ 0004h
IPR2_DMA1AIP_POSN                        equ 0003h
IPR2_DMA1AIP_POSITION                    equ 0003h
IPR2_DMA1AIP_SIZE                        equ 0001h
IPR2_DMA1AIP_LENGTH                      equ 0001h
IPR2_DMA1AIP_MASK                        equ 0008h
IPR2_SPI1RXIP_POSN                       equ 0004h
IPR2_SPI1RXIP_POSITION                   equ 0004h
IPR2_SPI1RXIP_SIZE                       equ 0001h
IPR2_SPI1RXIP_LENGTH                     equ 0001h
IPR2_SPI1RXIP_MASK                       equ 0010h
IPR2_SPI1TXIP_POSN                       equ 0005h
IPR2_SPI1TXIP_POSITION                   equ 0005h
IPR2_SPI1TXIP_SIZE                       equ 0001h
IPR2_SPI1TXIP_LENGTH                     equ 0001h
IPR2_SPI1TXIP_MASK                       equ 0020h
IPR2_SPI1IP_POSN                         equ 0006h
IPR2_SPI1IP_POSITION                     equ 0006h
IPR2_SPI1IP_SIZE                         equ 0001h
IPR2_SPI1IP_LENGTH                       equ 0001h
IPR2_SPI1IP_MASK                         equ 0040h
IPR2_I2C1RXIP_POSN                       equ 0007h
IPR2_I2C1RXIP_POSITION                   equ 0007h
IPR2_I2C1RXIP_SIZE                       equ 0001h
IPR2_I2C1RXIP_LENGTH                     equ 0001h
IPR2_I2C1RXIP_MASK                       equ 0080h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 03983h
// bitfield definitions
IPR3_I2C1TXIP_POSN                       equ 0000h
IPR3_I2C1TXIP_POSITION                   equ 0000h
IPR3_I2C1TXIP_SIZE                       equ 0001h
IPR3_I2C1TXIP_LENGTH                     equ 0001h
IPR3_I2C1TXIP_MASK                       equ 0001h
IPR3_I2C1IP_POSN                         equ 0001h
IPR3_I2C1IP_POSITION                     equ 0001h
IPR3_I2C1IP_SIZE                         equ 0001h
IPR3_I2C1IP_LENGTH                       equ 0001h
IPR3_I2C1IP_MASK                         equ 0002h
IPR3_I2C1EIP_POSN                        equ 0002h
IPR3_I2C1EIP_POSITION                    equ 0002h
IPR3_I2C1EIP_SIZE                        equ 0001h
IPR3_I2C1EIP_LENGTH                      equ 0001h
IPR3_I2C1EIP_MASK                        equ 0004h
IPR3_U1RXIP_POSN                         equ 0003h
IPR3_U1RXIP_POSITION                     equ 0003h
IPR3_U1RXIP_SIZE                         equ 0001h
IPR3_U1RXIP_LENGTH                       equ 0001h
IPR3_U1RXIP_MASK                         equ 0008h
IPR3_U1TXIP_POSN                         equ 0004h
IPR3_U1TXIP_POSITION                     equ 0004h
IPR3_U1TXIP_SIZE                         equ 0001h
IPR3_U1TXIP_LENGTH                       equ 0001h
IPR3_U1TXIP_MASK                         equ 0010h
IPR3_U1EIP_POSN                          equ 0005h
IPR3_U1EIP_POSITION                      equ 0005h
IPR3_U1EIP_SIZE                          equ 0001h
IPR3_U1EIP_LENGTH                        equ 0001h
IPR3_U1EIP_MASK                          equ 0020h
IPR3_U1IP_POSN                           equ 0006h
IPR3_U1IP_POSITION                       equ 0006h
IPR3_U1IP_SIZE                           equ 0001h
IPR3_U1IP_LENGTH                         equ 0001h
IPR3_U1IP_MASK                           equ 0040h
IPR3_TMR0IP_POSN                         equ 0007h
IPR3_TMR0IP_POSITION                     equ 0007h
IPR3_TMR0IP_SIZE                         equ 0001h
IPR3_TMR0IP_LENGTH                       equ 0001h
IPR3_TMR0IP_MASK                         equ 0080h

