GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 03A80h
// bitfield definitions
ANSELE_ANSELE0_POSN                      equ 0000h
ANSELE_ANSELE0_POSITION                  equ 0000h
ANSELE_ANSELE0_SIZE                      equ 0001h
ANSELE_ANSELE0_LENGTH                    equ 0001h
ANSELE_ANSELE0_MASK                      equ 0001h
ANSELE_ANSELE1_POSN                      equ 0001h
ANSELE_ANSELE1_POSITION                  equ 0001h
ANSELE_ANSELE1_SIZE                      equ 0001h
ANSELE_ANSELE1_LENGTH                    equ 0001h
ANSELE_ANSELE1_MASK                      equ 0002h
ANSELE_ANSELE2_POSN                      equ 0002h
ANSELE_ANSELE2_POSITION                  equ 0002h
ANSELE_ANSELE2_SIZE                      equ 0001h
ANSELE_ANSELE2_LENGTH                    equ 0001h
ANSELE_ANSELE2_MASK                      equ 0004h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 03A81h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 03A82h
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h
ODCONE_ODCE2_POSN                        equ 0002h
ODCONE_ODCE2_POSITION                    equ 0002h
ODCONE_ODCE2_SIZE                        equ 0001h
ODCONE_ODCE2_LENGTH                      equ 0001h
ODCONE_ODCE2_MASK                        equ 0004h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 03A83h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 03A84h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 03A85h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 03A86h
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 03A87h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: ANSELF
#define ANSELF ANSELF
ANSELF                                   equ 03A90h
// bitfield definitions
ANSELF_ANSELF0_POSN                      equ 0000h
ANSELF_ANSELF0_POSITION                  equ 0000h
ANSELF_ANSELF0_SIZE                      equ 0001h
ANSELF_ANSELF0_LENGTH                    equ 0001h
ANSELF_ANSELF0_MASK                      equ 0001h
ANSELF_ANSELF1_POSN                      equ 0001h
ANSELF_ANSELF1_POSITION                  equ 0001h
ANSELF_ANSELF1_SIZE                      equ 0001h
ANSELF_ANSELF1_LENGTH                    equ 0001h
ANSELF_ANSELF1_MASK                      equ 0002h
ANSELF_ANSELF2_POSN                      equ 0002h
ANSELF_ANSELF2_POSITION                  equ 0002h
ANSELF_ANSELF2_SIZE                      equ 0001h
ANSELF_ANSELF2_LENGTH                    equ 0001h
ANSELF_ANSELF2_MASK                      equ 0004h
ANSELF_ANSELF3_POSN                      equ 0003h
ANSELF_ANSELF3_POSITION                  equ 0003h
ANSELF_ANSELF3_SIZE                      equ 0001h
ANSELF_ANSELF3_LENGTH                    equ 0001h
ANSELF_ANSELF3_MASK                      equ 0008h
ANSELF_ANSELF4_POSN                      equ 0004h
ANSELF_ANSELF4_POSITION                  equ 0004h
ANSELF_ANSELF4_SIZE                      equ 0001h
ANSELF_ANSELF4_LENGTH                    equ 0001h
ANSELF_ANSELF4_MASK                      equ 0010h
ANSELF_ANSELF5_POSN                      equ 0005h
ANSELF_ANSELF5_POSITION                  equ 0005h
ANSELF_ANSELF5_SIZE                      equ 0001h
ANSELF_ANSELF5_LENGTH                    equ 0001h
ANSELF_ANSELF5_MASK                      equ 0020h
ANSELF_ANSELF6_POSN                      equ 0006h
ANSELF_ANSELF6_POSITION                  equ 0006h
ANSELF_ANSELF6_SIZE                      equ 0001h
ANSELF_ANSELF6_LENGTH                    equ 0001h
ANSELF_ANSELF6_MASK                      equ 0040h
ANSELF_ANSELF7_POSN                      equ 0007h
ANSELF_ANSELF7_POSITION                  equ 0007h
ANSELF_ANSELF7_SIZE                      equ 0001h
ANSELF_ANSELF7_LENGTH                    equ 0001h
ANSELF_ANSELF7_MASK                      equ 0080h

// Register: WPUF
#define WPUF WPUF
WPUF                                     equ 03A91h
// bitfield definitions
WPUF_WPUF0_POSN                          equ 0000h
WPUF_WPUF0_POSITION                      equ 0000h
WPUF_WPUF0_SIZE                          equ 0001h
WPUF_WPUF0_LENGTH                        equ 0001h
WPUF_WPUF0_MASK                          equ 0001h
WPUF_WPUF1_POSN                          equ 0001h
WPUF_WPUF1_POSITION                      equ 0001h
WPUF_WPUF1_SIZE                          equ 0001h
WPUF_WPUF1_LENGTH                        equ 0001h
WPUF_WPUF1_MASK                          equ 0002h
WPUF_WPUF2_POSN                          equ 0002h
WPUF_WPUF2_POSITION                      equ 0002h
WPUF_WPUF2_SIZE                          equ 0001h
WPUF_WPUF2_LENGTH                        equ 0001h
WPUF_WPUF2_MASK                          equ 0004h
WPUF_WPUF3_POSN                          equ 0003h
WPUF_WPUF3_POSITION                      equ 0003h
WPUF_WPUF3_SIZE                          equ 0001h
WPUF_WPUF3_LENGTH                        equ 0001h
WPUF_WPUF3_MASK                          equ 0008h
WPUF_WPUF4_POSN                          equ 0004h
WPUF_WPUF4_POSITION                      equ 0004h
WPUF_WPUF4_SIZE                          equ 0001h
WPUF_WPUF4_LENGTH                        equ 0001h
WPUF_WPUF4_MASK                          equ 0010h
WPUF_WPUF5_POSN                          equ 0005h
WPUF_WPUF5_POSITION                      equ 0005h
WPUF_WPUF5_SIZE                          equ 0001h
WPUF_WPUF5_LENGTH                        equ 0001h
WPUF_WPUF5_MASK                          equ 0020h
WPUF_WPUF6_POSN                          equ 0006h
WPUF_WPUF6_POSITION                      equ 0006h
WPUF_WPUF6_SIZE                          equ 0001h
WPUF_WPUF6_LENGTH                        equ 0001h
WPUF_WPUF6_MASK                          equ 0040h
WPUF_WPUF7_POSN                          equ 0007h
WPUF_WPUF7_POSITION                      equ 0007h
WPUF_WPUF7_SIZE                          equ 0001h
WPUF_WPUF7_LENGTH                        equ 0001h
WPUF_WPUF7_MASK                          equ 0080h

