GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.inc
// Register: DMA1SPTRH
#define DMA1SPTRH DMA1SPTRH
DMA1SPTRH                                equ 03BF5h
// bitfield definitions
DMA1SPTRH_SPTR_POSN                      equ 0000h
DMA1SPTRH_SPTR_POSITION                  equ 0000h
DMA1SPTRH_SPTR_SIZE                      equ 0008h
DMA1SPTRH_SPTR_LENGTH                    equ 0008h
DMA1SPTRH_SPTR_MASK                      equ 00FFh
DMA1SPTRH_SPTR8_POSN                     equ 0000h
DMA1SPTRH_SPTR8_POSITION                 equ 0000h
DMA1SPTRH_SPTR8_SIZE                     equ 0001h
DMA1SPTRH_SPTR8_LENGTH                   equ 0001h
DMA1SPTRH_SPTR8_MASK                     equ 0001h
DMA1SPTRH_SPTR9_POSN                     equ 0001h
DMA1SPTRH_SPTR9_POSITION                 equ 0001h
DMA1SPTRH_SPTR9_SIZE                     equ 0001h
DMA1SPTRH_SPTR9_LENGTH                   equ 0001h
DMA1SPTRH_SPTR9_MASK                     equ 0002h
DMA1SPTRH_SPTR10_POSN                    equ 0002h
DMA1SPTRH_SPTR10_POSITION                equ 0002h
DMA1SPTRH_SPTR10_SIZE                    equ 0001h
DMA1SPTRH_SPTR10_LENGTH                  equ 0001h
DMA1SPTRH_SPTR10_MASK                    equ 0004h
DMA1SPTRH_SPTR11_POSN                    equ 0003h
DMA1SPTRH_SPTR11_POSITION                equ 0003h
DMA1SPTRH_SPTR11_SIZE                    equ 0001h
DMA1SPTRH_SPTR11_LENGTH                  equ 0001h
DMA1SPTRH_SPTR11_MASK                    equ 0008h
DMA1SPTRH_SPTR12_POSN                    equ 0004h
DMA1SPTRH_SPTR12_POSITION                equ 0004h
DMA1SPTRH_SPTR12_SIZE                    equ 0001h
DMA1SPTRH_SPTR12_LENGTH                  equ 0001h
DMA1SPTRH_SPTR12_MASK                    equ 0010h
DMA1SPTRH_SPTR13_POSN                    equ 0005h
DMA1SPTRH_SPTR13_POSITION                equ 0005h
DMA1SPTRH_SPTR13_SIZE                    equ 0001h
DMA1SPTRH_SPTR13_LENGTH                  equ 0001h
DMA1SPTRH_SPTR13_MASK                    equ 0020h
DMA1SPTRH_SPTR14_POSN                    equ 0006h
DMA1SPTRH_SPTR14_POSITION                equ 0006h
DMA1SPTRH_SPTR14_SIZE                    equ 0001h
DMA1SPTRH_SPTR14_LENGTH                  equ 0001h
DMA1SPTRH_SPTR14_MASK                    equ 0040h
DMA1SPTRH_SPTR15_POSN                    equ 0007h
DMA1SPTRH_SPTR15_POSITION                equ 0007h
DMA1SPTRH_SPTR15_SIZE                    equ 0001h
DMA1SPTRH_SPTR15_LENGTH                  equ 0001h
DMA1SPTRH_SPTR15_MASK                    equ 0080h
DMA1SPTRH_DMA1SPTR_POSN                  equ 0000h
DMA1SPTRH_DMA1SPTR_POSITION              equ 0000h
DMA1SPTRH_DMA1SPTR_SIZE                  equ 0008h
DMA1SPTRH_DMA1SPTR_LENGTH                equ 0008h
DMA1SPTRH_DMA1SPTR_MASK                  equ 00FFh
DMA1SPTRH_DMA1SPTR8_POSN                 equ 0000h
DMA1SPTRH_DMA1SPTR8_POSITION             equ 0000h
DMA1SPTRH_DMA1SPTR8_SIZE                 equ 0001h
DMA1SPTRH_DMA1SPTR8_LENGTH               equ 0001h
DMA1SPTRH_DMA1SPTR8_MASK                 equ 0001h
DMA1SPTRH_DMA1SPTR9_POSN                 equ 0001h
DMA1SPTRH_DMA1SPTR9_POSITION             equ 0001h
DMA1SPTRH_DMA1SPTR9_SIZE                 equ 0001h
DMA1SPTRH_DMA1SPTR9_LENGTH               equ 0001h
DMA1SPTRH_DMA1SPTR9_MASK                 equ 0002h
DMA1SPTRH_DMA1SPTR10_POSN                equ 0002h
DMA1SPTRH_DMA1SPTR10_POSITION            equ 0002h
DMA1SPTRH_DMA1SPTR10_SIZE                equ 0001h
DMA1SPTRH_DMA1SPTR10_LENGTH              equ 0001h
DMA1SPTRH_DMA1SPTR10_MASK                equ 0004h
DMA1SPTRH_DMA1SPTR11_POSN                equ 0003h
DMA1SPTRH_DMA1SPTR11_POSITION            equ 0003h
DMA1SPTRH_DMA1SPTR11_SIZE                equ 0001h
DMA1SPTRH_DMA1SPTR11_LENGTH              equ 0001h
DMA1SPTRH_DMA1SPTR11_MASK                equ 0008h
DMA1SPTRH_DMA1SPTR12_POSN                equ 0004h
DMA1SPTRH_DMA1SPTR12_POSITION            equ 0004h
DMA1SPTRH_DMA1SPTR12_SIZE                equ 0001h
DMA1SPTRH_DMA1SPTR12_LENGTH              equ 0001h
DMA1SPTRH_DMA1SPTR12_MASK                equ 0010h
DMA1SPTRH_DMA1SPTR13_POSN                equ 0005h
DMA1SPTRH_DMA1SPTR13_POSITION            equ 0005h
DMA1SPTRH_DMA1SPTR13_SIZE                equ 0001h
DMA1SPTRH_DMA1SPTR13_LENGTH              equ 0001h
DMA1SPTRH_DMA1SPTR13_MASK                equ 0020h
DMA1SPTRH_DMA1SPTR14_POSN                equ 0006h
DMA1SPTRH_DMA1SPTR14_POSITION            equ 0006h
DMA1SPTRH_DMA1SPTR14_SIZE                equ 0001h
DMA1SPTRH_DMA1SPTR14_LENGTH              equ 0001h
DMA1SPTRH_DMA1SPTR14_MASK                equ 0040h
DMA1SPTRH_DMA1SPTR15_POSN                equ 0007h
DMA1SPTRH_DMA1SPTR15_POSITION            equ 0007h
DMA1SPTRH_DMA1SPTR15_SIZE                equ 0001h
DMA1SPTRH_DMA1SPTR15_LENGTH              equ 0001h
DMA1SPTRH_DMA1SPTR15_MASK                equ 0080h

// Register: DMA1SPTRU
#define DMA1SPTRU DMA1SPTRU
DMA1SPTRU                                equ 03BF6h
// bitfield definitions
DMA1SPTRU_SPTR_POSN                      equ 0000h
DMA1SPTRU_SPTR_POSITION                  equ 0000h
DMA1SPTRU_SPTR_SIZE                      equ 0006h
DMA1SPTRU_SPTR_LENGTH                    equ 0006h
DMA1SPTRU_SPTR_MASK                      equ 003Fh
DMA1SPTRU_SPTR16_POSN                    equ 0000h
DMA1SPTRU_SPTR16_POSITION                equ 0000h
DMA1SPTRU_SPTR16_SIZE                    equ 0001h
DMA1SPTRU_SPTR16_LENGTH                  equ 0001h
DMA1SPTRU_SPTR16_MASK                    equ 0001h
DMA1SPTRU_SPTR17_POSN                    equ 0001h
DMA1SPTRU_SPTR17_POSITION                equ 0001h
DMA1SPTRU_SPTR17_SIZE                    equ 0001h
DMA1SPTRU_SPTR17_LENGTH                  equ 0001h
DMA1SPTRU_SPTR17_MASK                    equ 0002h
DMA1SPTRU_SPTR18_POSN                    equ 0002h
DMA1SPTRU_SPTR18_POSITION                equ 0002h
DMA1SPTRU_SPTR18_SIZE                    equ 0001h
DMA1SPTRU_SPTR18_LENGTH                  equ 0001h
DMA1SPTRU_SPTR18_MASK                    equ 0004h
DMA1SPTRU_SPTR19_POSN                    equ 0003h
DMA1SPTRU_SPTR19_POSITION                equ 0003h
DMA1SPTRU_SPTR19_SIZE                    equ 0001h
DMA1SPTRU_SPTR19_LENGTH                  equ 0001h
DMA1SPTRU_SPTR19_MASK                    equ 0008h
DMA1SPTRU_SPTR20_POSN                    equ 0004h
DMA1SPTRU_SPTR20_POSITION                equ 0004h
DMA1SPTRU_SPTR20_SIZE                    equ 0001h
DMA1SPTRU_SPTR20_LENGTH                  equ 0001h
DMA1SPTRU_SPTR20_MASK                    equ 0010h
DMA1SPTRU_SPTR21_POSN                    equ 0005h
DMA1SPTRU_SPTR21_POSITION                equ 0005h
DMA1SPTRU_SPTR21_SIZE                    equ 0001h
DMA1SPTRU_SPTR21_LENGTH                  equ 0001h
DMA1SPTRU_SPTR21_MASK                    equ 0020h
DMA1SPTRU_DMA1SPTR_POSN                  equ 0000h
DMA1SPTRU_DMA1SPTR_POSITION              equ 0000h
DMA1SPTRU_DMA1SPTR_SIZE                  equ 0006h
DMA1SPTRU_DMA1SPTR_LENGTH                equ 0006h
DMA1SPTRU_DMA1SPTR_MASK                  equ 003Fh
DMA1SPTRU_DMA1SPTR16_POSN                equ 0000h
DMA1SPTRU_DMA1SPTR16_POSITION            equ 0000h
DMA1SPTRU_DMA1SPTR16_SIZE                equ 0001h
DMA1SPTRU_DMA1SPTR16_LENGTH              equ 0001h
DMA1SPTRU_DMA1SPTR16_MASK                equ 0001h
DMA1SPTRU_DMA1SPTR17_POSN                equ 0001h
DMA1SPTRU_DMA1SPTR17_POSITION            equ 0001h
DMA1SPTRU_DMA1SPTR17_SIZE                equ 0001h
DMA1SPTRU_DMA1SPTR17_LENGTH              equ 0001h
DMA1SPTRU_DMA1SPTR17_MASK                equ 0002h
DMA1SPTRU_DMA1SPTR18_POSN                equ 0002h
DMA1SPTRU_DMA1SPTR18_POSITION            equ 0002h
DMA1SPTRU_DMA1SPTR18_SIZE                equ 0001h
DMA1SPTRU_DMA1SPTR18_LENGTH              equ 0001h
DMA1SPTRU_DMA1SPTR18_MASK                equ 0004h
DMA1SPTRU_DMA1SPTR19_POSN                equ 0003h
DMA1SPTRU_DMA1SPTR19_POSITION            equ 0003h
DMA1SPTRU_DMA1SPTR19_SIZE                equ 0001h
DMA1SPTRU_DMA1SPTR19_LENGTH              equ 0001h
DMA1SPTRU_DMA1SPTR19_MASK                equ 0008h
DMA1SPTRU_DMA1SPTR20_POSN                equ 0004h
DMA1SPTRU_DMA1SPTR20_POSITION            equ 0004h
DMA1SPTRU_DMA1SPTR20_SIZE                equ 0001h
DMA1SPTRU_DMA1SPTR20_LENGTH              equ 0001h
DMA1SPTRU_DMA1SPTR20_MASK                equ 0010h
DMA1SPTRU_DMA1SPTR21_POSN                equ 0005h
DMA1SPTRU_DMA1SPTR21_POSITION            equ 0005h
DMA1SPTRU_DMA1SPTR21_SIZE                equ 0001h
DMA1SPTRU_DMA1SPTR21_LENGTH              equ 0001h
DMA1SPTRU_DMA1SPTR21_MASK                equ 0020h

// Register: DMA1SSZ
#define DMA1SSZ DMA1SSZ
DMA1SSZ                                  equ 03BF7h

// Register: DMA1SSZL
#define DMA1SSZL DMA1SSZL
DMA1SSZL                                 equ 03BF7h
// bitfield definitions
DMA1SSZL_SSZ_POSN                        equ 0000h
DMA1SSZL_SSZ_POSITION                    equ 0000h
DMA1SSZL_SSZ_SIZE                        equ 0008h
DMA1SSZL_SSZ_LENGTH                      equ 0008h
DMA1SSZL_SSZ_MASK                        equ 00FFh
DMA1SSZL_DMA1SSZ_POSN                    equ 0000h
DMA1SSZL_DMA1SSZ_POSITION                equ 0000h
DMA1SSZL_DMA1SSZ_SIZE                    equ 0008h
DMA1SSZL_DMA1SSZ_LENGTH                  equ 0008h
DMA1SSZL_DMA1SSZ_MASK                    equ 00FFh
DMA1SSZL_SSZ0_POSN                       equ 0000h
DMA1SSZL_SSZ0_POSITION                   equ 0000h
DMA1SSZL_SSZ0_SIZE                       equ 0001h
DMA1SSZL_SSZ0_LENGTH                     equ 0001h
DMA1SSZL_SSZ0_MASK                       equ 0001h
DMA1SSZL_SSZ1_POSN                       equ 0001h
DMA1SSZL_SSZ1_POSITION                   equ 0001h
DMA1SSZL_SSZ1_SIZE                       equ 0001h
DMA1SSZL_SSZ1_LENGTH                     equ 0001h
DMA1SSZL_SSZ1_MASK                       equ 0002h
DMA1SSZL_SSZ2_POSN                       equ 0002h
DMA1SSZL_SSZ2_POSITION                   equ 0002h
DMA1SSZL_SSZ2_SIZE                       equ 0001h
DMA1SSZL_SSZ2_LENGTH                     equ 0001h
DMA1SSZL_SSZ2_MASK                       equ 0004h
DMA1SSZL_SSZ3_POSN                       equ 0003h
DMA1SSZL_SSZ3_POSITION                   equ 0003h
DMA1SSZL_SSZ3_SIZE                       equ 0001h
DMA1SSZL_SSZ3_LENGTH                     equ 0001h
DMA1SSZL_SSZ3_MASK                       equ 0008h
DMA1SSZL_SSZ4_POSN                       equ 0004h
DMA1SSZL_SSZ4_POSITION                   equ 0004h
DMA1SSZL_SSZ4_SIZE                       equ 0001h
DMA1SSZL_SSZ4_LENGTH                     equ 0001h
DMA1SSZL_SSZ4_MASK                       equ 0010h
DMA1SSZL_SSZ5_POSN                       equ 0005h
DMA1SSZL_SSZ5_POSITION                   equ 0005h
DMA1SSZL_SSZ5_SIZE                       equ 0001h
DMA1SSZL_SSZ5_LENGTH                     equ 0001h
DMA1SSZL_SSZ5_MASK                       equ 0020h
DMA1SSZL_SSZ6_POSN                       equ 0006h
DMA1SSZL_SSZ6_POSITION                   equ 0006h
DMA1SSZL_SSZ6_SIZE                       equ 0001h
DMA1SSZL_SSZ6_LENGTH                     equ 0001h
DMA1SSZL_SSZ6_MASK                       equ 0040h
DMA1SSZL_SSZ7_POSN                       equ 0007h
DMA1SSZL_SSZ7_POSITION                   equ 0007h
DMA1SSZL_SSZ7_SIZE                       equ 0001h
DMA1SSZL_SSZ7_LENGTH                     equ 0001h
DMA1SSZL_SSZ7_MASK                       equ 0080h
DMA1SSZL_DMA1SSZ0_POSN                   equ 0000h
DMA1SSZL_DMA1SSZ0_POSITION               equ 0000h
DMA1SSZL_DMA1SSZ0_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ0_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ0_MASK                   equ 0001h
DMA1SSZL_DMA1SSZ1_POSN                   equ 0001h
DMA1SSZL_DMA1SSZ1_POSITION               equ 0001h
DMA1SSZL_DMA1SSZ1_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ1_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ1_MASK                   equ 0002h
DMA1SSZL_DMA1SSZ2_POSN                   equ 0002h
DMA1SSZL_DMA1SSZ2_POSITION               equ 0002h
DMA1SSZL_DMA1SSZ2_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ2_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ2_MASK                   equ 0004h
DMA1SSZL_DMA1SSZ3_POSN                   equ 0003h
DMA1SSZL_DMA1SSZ3_POSITION               equ 0003h
DMA1SSZL_DMA1SSZ3_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ3_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ3_MASK                   equ 0008h
DMA1SSZL_DMA1SSZ4_POSN                   equ 0004h
DMA1SSZL_DMA1SSZ4_POSITION               equ 0004h
DMA1SSZL_DMA1SSZ4_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ4_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ4_MASK                   equ 0010h
DMA1SSZL_DMA1SSZ5_POSN                   equ 0005h
DMA1SSZL_DMA1SSZ5_POSITION               equ 0005h
DMA1SSZL_DMA1SSZ5_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ5_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ5_MASK                   equ 0020h
DMA1SSZL_DMA1SSZ6_POSN                   equ 0006h
DMA1SSZL_DMA1SSZ6_POSITION               equ 0006h
DMA1SSZL_DMA1SSZ6_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ6_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ6_MASK                   equ 0040h
DMA1SSZL_DMA1SSZ7_POSN                   equ 0007h
DMA1SSZL_DMA1SSZ7_POSITION               equ 0007h
DMA1SSZL_DMA1SSZ7_SIZE                   equ 0001h
DMA1SSZL_DMA1SSZ7_LENGTH                 equ 0001h
DMA1SSZL_DMA1SSZ7_MASK                   equ 0080h

