GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.inc
// Register: ADPREVH
#define ADPREVH ADPREVH
ADPREVH                                  equ 03EEEh
// bitfield definitions
ADPREVH_PREV_POSN                        equ 0000h
ADPREVH_PREV_POSITION                    equ 0000h
ADPREVH_PREV_SIZE                        equ 0008h
ADPREVH_PREV_LENGTH                      equ 0008h
ADPREVH_PREV_MASK                        equ 00FFh
ADPREVH_ADPREV8_POSN                     equ 0000h
ADPREVH_ADPREV8_POSITION                 equ 0000h
ADPREVH_ADPREV8_SIZE                     equ 0001h
ADPREVH_ADPREV8_LENGTH                   equ 0001h
ADPREVH_ADPREV8_MASK                     equ 0001h
ADPREVH_ADPREV9_POSN                     equ 0001h
ADPREVH_ADPREV9_POSITION                 equ 0001h
ADPREVH_ADPREV9_SIZE                     equ 0001h
ADPREVH_ADPREV9_LENGTH                   equ 0001h
ADPREVH_ADPREV9_MASK                     equ 0002h
ADPREVH_ADPREV10_POSN                    equ 0002h
ADPREVH_ADPREV10_POSITION                equ 0002h
ADPREVH_ADPREV10_SIZE                    equ 0001h
ADPREVH_ADPREV10_LENGTH                  equ 0001h
ADPREVH_ADPREV10_MASK                    equ 0004h
ADPREVH_ADPREV11_POSN                    equ 0003h
ADPREVH_ADPREV11_POSITION                equ 0003h
ADPREVH_ADPREV11_SIZE                    equ 0001h
ADPREVH_ADPREV11_LENGTH                  equ 0001h
ADPREVH_ADPREV11_MASK                    equ 0008h
ADPREVH_ADPREV12_POSN                    equ 0004h
ADPREVH_ADPREV12_POSITION                equ 0004h
ADPREVH_ADPREV12_SIZE                    equ 0001h
ADPREVH_ADPREV12_LENGTH                  equ 0001h
ADPREVH_ADPREV12_MASK                    equ 0010h
ADPREVH_ADPREV13_POSN                    equ 0005h
ADPREVH_ADPREV13_POSITION                equ 0005h
ADPREVH_ADPREV13_SIZE                    equ 0001h
ADPREVH_ADPREV13_LENGTH                  equ 0001h
ADPREVH_ADPREV13_MASK                    equ 0020h
ADPREVH_ADPREV14_POSN                    equ 0006h
ADPREVH_ADPREV14_POSITION                equ 0006h
ADPREVH_ADPREV14_SIZE                    equ 0001h
ADPREVH_ADPREV14_LENGTH                  equ 0001h
ADPREVH_ADPREV14_MASK                    equ 0040h
ADPREVH_ADPREV15_POSN                    equ 0007h
ADPREVH_ADPREV15_POSITION                equ 0007h
ADPREVH_ADPREV15_SIZE                    equ 0001h
ADPREVH_ADPREV15_LENGTH                  equ 0001h
ADPREVH_ADPREV15_MASK                    equ 0080h
ADPREVH_ADPREV_POSN                      equ 0000h
ADPREVH_ADPREV_POSITION                  equ 0000h
ADPREVH_ADPREV_SIZE                      equ 0008h
ADPREVH_ADPREV_LENGTH                    equ 0008h
ADPREVH_ADPREV_MASK                      equ 00FFh
ADPREVH_PREV8_POSN                       equ 0000h
ADPREVH_PREV8_POSITION                   equ 0000h
ADPREVH_PREV8_SIZE                       equ 0001h
ADPREVH_PREV8_LENGTH                     equ 0001h
ADPREVH_PREV8_MASK                       equ 0001h
ADPREVH_PREV9_POSN                       equ 0001h
ADPREVH_PREV9_POSITION                   equ 0001h
ADPREVH_PREV9_SIZE                       equ 0001h
ADPREVH_PREV9_LENGTH                     equ 0001h
ADPREVH_PREV9_MASK                       equ 0002h
ADPREVH_PREV10_POSN                      equ 0002h
ADPREVH_PREV10_POSITION                  equ 0002h
ADPREVH_PREV10_SIZE                      equ 0001h
ADPREVH_PREV10_LENGTH                    equ 0001h
ADPREVH_PREV10_MASK                      equ 0004h
ADPREVH_PREV11_POSN                      equ 0003h
ADPREVH_PREV11_POSITION                  equ 0003h
ADPREVH_PREV11_SIZE                      equ 0001h
ADPREVH_PREV11_LENGTH                    equ 0001h
ADPREVH_PREV11_MASK                      equ 0008h
ADPREVH_PREV12_POSN                      equ 0004h
ADPREVH_PREV12_POSITION                  equ 0004h
ADPREVH_PREV12_SIZE                      equ 0001h
ADPREVH_PREV12_LENGTH                    equ 0001h
ADPREVH_PREV12_MASK                      equ 0010h
ADPREVH_PREV13_POSN                      equ 0005h
ADPREVH_PREV13_POSITION                  equ 0005h
ADPREVH_PREV13_SIZE                      equ 0001h
ADPREVH_PREV13_LENGTH                    equ 0001h
ADPREVH_PREV13_MASK                      equ 0020h
ADPREVH_PREV14_POSN                      equ 0006h
ADPREVH_PREV14_POSITION                  equ 0006h
ADPREVH_PREV14_SIZE                      equ 0001h
ADPREVH_PREV14_LENGTH                    equ 0001h
ADPREVH_PREV14_MASK                      equ 0040h
ADPREVH_PREV15_POSN                      equ 0007h
ADPREVH_PREV15_POSITION                  equ 0007h
ADPREVH_PREV15_SIZE                      equ 0001h
ADPREVH_PREV15_LENGTH                    equ 0001h
ADPREVH_PREV15_MASK                      equ 0080h

// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 03EEFh

// Register: ADRESL
#define ADRESL ADRESL
ADRESL                                   equ 03EEFh
// bitfield definitions
ADRESL_RES_POSN                          equ 0000h
ADRESL_RES_POSITION                      equ 0000h
ADRESL_RES_SIZE                          equ 0008h
ADRESL_RES_LENGTH                        equ 0008h
ADRESL_RES_MASK                          equ 00FFh
ADRESL_ADRES0_POSN                       equ 0000h
ADRESL_ADRES0_POSITION                   equ 0000h
ADRESL_ADRES0_SIZE                       equ 0001h
ADRESL_ADRES0_LENGTH                     equ 0001h
ADRESL_ADRES0_MASK                       equ 0001h
ADRESL_ADRES1_POSN                       equ 0001h
ADRESL_ADRES1_POSITION                   equ 0001h
ADRESL_ADRES1_SIZE                       equ 0001h
ADRESL_ADRES1_LENGTH                     equ 0001h
ADRESL_ADRES1_MASK                       equ 0002h
ADRESL_ADRES2_POSN                       equ 0002h
ADRESL_ADRES2_POSITION                   equ 0002h
ADRESL_ADRES2_SIZE                       equ 0001h
ADRESL_ADRES2_LENGTH                     equ 0001h
ADRESL_ADRES2_MASK                       equ 0004h
ADRESL_ADRES3_POSN                       equ 0003h
ADRESL_ADRES3_POSITION                   equ 0003h
ADRESL_ADRES3_SIZE                       equ 0001h
ADRESL_ADRES3_LENGTH                     equ 0001h
ADRESL_ADRES3_MASK                       equ 0008h
ADRESL_ADRES4_POSN                       equ 0004h
ADRESL_ADRES4_POSITION                   equ 0004h
ADRESL_ADRES4_SIZE                       equ 0001h
ADRESL_ADRES4_LENGTH                     equ 0001h
ADRESL_ADRES4_MASK                       equ 0010h
ADRESL_ADRES5_POSN                       equ 0005h
ADRESL_ADRES5_POSITION                   equ 0005h
ADRESL_ADRES5_SIZE                       equ 0001h
ADRESL_ADRES5_LENGTH                     equ 0001h
ADRESL_ADRES5_MASK                       equ 0020h
ADRESL_ADRES6_POSN                       equ 0006h
ADRESL_ADRES6_POSITION                   equ 0006h
ADRESL_ADRES6_SIZE                       equ 0001h
ADRESL_ADRES6_LENGTH                     equ 0001h
ADRESL_ADRES6_MASK                       equ 0040h
ADRESL_ADRES7_POSN                       equ 0007h
ADRESL_ADRES7_POSITION                   equ 0007h
ADRESL_ADRES7_SIZE                       equ 0001h
ADRESL_ADRES7_LENGTH                     equ 0001h
ADRESL_ADRES7_MASK                       equ 0080h
ADRESL_ADRES_POSN                        equ 0000h
ADRESL_ADRES_POSITION                    equ 0000h
ADRESL_ADRES_SIZE                        equ 0008h
ADRESL_ADRES_LENGTH                      equ 0008h
ADRESL_ADRES_MASK                        equ 00FFh
ADRESL_RES0_POSN                         equ 0000h
ADRESL_RES0_POSITION                     equ 0000h
ADRESL_RES0_SIZE                         equ 0001h
ADRESL_RES0_LENGTH                       equ 0001h
ADRESL_RES0_MASK                         equ 0001h
ADRESL_RES1_POSN                         equ 0001h
ADRESL_RES1_POSITION                     equ 0001h
ADRESL_RES1_SIZE                         equ 0001h
ADRESL_RES1_LENGTH                       equ 0001h
ADRESL_RES1_MASK                         equ 0002h
ADRESL_RES2_POSN                         equ 0002h
ADRESL_RES2_POSITION                     equ 0002h
ADRESL_RES2_SIZE                         equ 0001h
ADRESL_RES2_LENGTH                       equ 0001h
ADRESL_RES2_MASK                         equ 0004h
ADRESL_RES3_POSN                         equ 0003h
ADRESL_RES3_POSITION                     equ 0003h
ADRESL_RES3_SIZE                         equ 0001h
ADRESL_RES3_LENGTH                       equ 0001h
ADRESL_RES3_MASK                         equ 0008h
ADRESL_RES4_POSN                         equ 0004h
ADRESL_RES4_POSITION                     equ 0004h
ADRESL_RES4_SIZE                         equ 0001h
ADRESL_RES4_LENGTH                       equ 0001h
ADRESL_RES4_MASK                         equ 0010h
ADRESL_RES5_POSN                         equ 0005h
ADRESL_RES5_POSITION                     equ 0005h
ADRESL_RES5_SIZE                         equ 0001h
ADRESL_RES5_LENGTH                       equ 0001h
ADRESL_RES5_MASK                         equ 0020h
ADRESL_RES6_POSN                         equ 0006h
ADRESL_RES6_POSITION                     equ 0006h
ADRESL_RES6_SIZE                         equ 0001h
ADRESL_RES6_LENGTH                       equ 0001h
ADRESL_RES6_MASK                         equ 0040h
ADRESL_RES7_POSN                         equ 0007h
ADRESL_RES7_POSITION                     equ 0007h
ADRESL_RES7_SIZE                         equ 0001h
ADRESL_RES7_LENGTH                       equ 0001h
ADRESL_RES7_MASK                         equ 0080h

// Register: ADRESH
#define ADRESH ADRESH
ADRESH                                   equ 03EF0h
// bitfield definitions
ADRESH_ADRES8_POSN                       equ 0000h
ADRESH_ADRES8_POSITION                   equ 0000h
ADRESH_ADRES8_SIZE                       equ 0001h
ADRESH_ADRES8_LENGTH                     equ 0001h
ADRESH_ADRES8_MASK                       equ 0001h
ADRESH_ADRES9_POSN                       equ 0001h
ADRESH_ADRES9_POSITION                   equ 0001h
ADRESH_ADRES9_SIZE                       equ 0001h
ADRESH_ADRES9_LENGTH                     equ 0001h
ADRESH_ADRES9_MASK                       equ 0002h
ADRESH_ADRES10_POSN                      equ 0002h
ADRESH_ADRES10_POSITION                  equ 0002h
ADRESH_ADRES10_SIZE                      equ 0001h
ADRESH_ADRES10_LENGTH                    equ 0001h
ADRESH_ADRES10_MASK                      equ 0004h
ADRESH_ADRES11_POSN                      equ 0003h
ADRESH_ADRES11_POSITION                  equ 0003h
ADRESH_ADRES11_SIZE                      equ 0001h
ADRESH_ADRES11_LENGTH                    equ 0001h
ADRESH_ADRES11_MASK                      equ 0008h
ADRESH_ADRES12_POSN                      equ 0004h
ADRESH_ADRES12_POSITION                  equ 0004h
ADRESH_ADRES12_SIZE                      equ 0001h
ADRESH_ADRES12_LENGTH                    equ 0001h
ADRESH_ADRES12_MASK                      equ 0010h
ADRESH_ADRES13_POSN                      equ 0005h
ADRESH_ADRES13_POSITION                  equ 0005h
ADRESH_ADRES13_SIZE                      equ 0001h
ADRESH_ADRES13_LENGTH                    equ 0001h
ADRESH_ADRES13_MASK                      equ 0020h
ADRESH_ADRES14_POSN                      equ 0006h
ADRESH_ADRES14_POSITION                  equ 0006h
ADRESH_ADRES14_SIZE                      equ 0001h
ADRESH_ADRES14_LENGTH                    equ 0001h
ADRESH_ADRES14_MASK                      equ 0040h
ADRESH_ADRES15_POSN                      equ 0007h
ADRESH_ADRES15_POSITION                  equ 0007h
ADRESH_ADRES15_SIZE                      equ 0001h
ADRESH_ADRES15_LENGTH                    equ 0001h
ADRESH_ADRES15_MASK                      equ 0080h
ADRESH_ADRES_POSN                        equ 0000h
ADRESH_ADRES_POSITION                    equ 0000h
ADRESH_ADRES_SIZE                        equ 0008h
ADRESH_ADRES_LENGTH                      equ 0008h
ADRESH_ADRES_MASK                        equ 00FFh
ADRESH_RES8_POSN                         equ 0000h
ADRESH_RES8_POSITION                     equ 0000h
ADRESH_RES8_SIZE                         equ 0001h
ADRESH_RES8_LENGTH                       equ 0001h
ADRESH_RES8_MASK                         equ 0001h
ADRESH_RES9_POSN                         equ 0001h
ADRESH_RES9_POSITION                     equ 0001h
ADRESH_RES9_SIZE                         equ 0001h
ADRESH_RES9_LENGTH                       equ 0001h
ADRESH_RES9_MASK                         equ 0002h
ADRESH_RES10_POSN                        equ 0002h
ADRESH_RES10_POSITION                    equ 0002h
ADRESH_RES10_SIZE                        equ 0001h
ADRESH_RES10_LENGTH                      equ 0001h
ADRESH_RES10_MASK                        equ 0004h
ADRESH_RES11_POSN                        equ 0003h
ADRESH_RES11_POSITION                    equ 0003h
ADRESH_RES11_SIZE                        equ 0001h
ADRESH_RES11_LENGTH                      equ 0001h
ADRESH_RES11_MASK                        equ 0008h
ADRESH_RES12_POSN                        equ 0004h
ADRESH_RES12_POSITION                    equ 0004h
ADRESH_RES12_SIZE                        equ 0001h
ADRESH_RES12_LENGTH                      equ 0001h
ADRESH_RES12_MASK                        equ 0010h
ADRESH_RES13_POSN                        equ 0005h
ADRESH_RES13_POSITION                    equ 0005h
ADRESH_RES13_SIZE                        equ 0001h
ADRESH_RES13_LENGTH                      equ 0001h
ADRESH_RES13_MASK                        equ 0020h
ADRESH_RES14_POSN                        equ 0006h
ADRESH_RES14_POSITION                    equ 0006h
ADRESH_RES14_SIZE                        equ 0001h
ADRESH_RES14_LENGTH                      equ 0001h
ADRESH_RES14_MASK                        equ 0040h
ADRESH_RES15_POSN                        equ 0007h
ADRESH_RES15_POSITION                    equ 0007h
ADRESH_RES15_SIZE                        equ 0001h
ADRESH_RES15_LENGTH                      equ 0001h
ADRESH_RES15_MASK                        equ 0080h

