GopalSaraf/Practicals/PSDL/include/proc/pic18f57k42.inc
// Register: CWG1AS0
#define CWG1AS0 CWG1AS0
CWG1AS0                                  equ 03F58h
// bitfield definitions
CWG1AS0_LSAC_POSN                        equ 0002h
CWG1AS0_LSAC_POSITION                    equ 0002h
CWG1AS0_LSAC_SIZE                        equ 0002h
CWG1AS0_LSAC_LENGTH                      equ 0002h
CWG1AS0_LSAC_MASK                        equ 000Ch
CWG1AS0_LSDBD_POSN                       equ 0004h
CWG1AS0_LSDBD_POSITION                   equ 0004h
CWG1AS0_LSDBD_SIZE                       equ 0002h
CWG1AS0_LSDBD_LENGTH                     equ 0002h
CWG1AS0_LSDBD_MASK                       equ 0030h
CWG1AS0_REN_POSN                         equ 0006h
CWG1AS0_REN_POSITION                     equ 0006h
CWG1AS0_REN_SIZE                         equ 0001h
CWG1AS0_REN_LENGTH                       equ 0001h
CWG1AS0_REN_MASK                         equ 0040h
CWG1AS0_SHUTDOWN_POSN                    equ 0007h
CWG1AS0_SHUTDOWN_POSITION                equ 0007h
CWG1AS0_SHUTDOWN_SIZE                    equ 0001h
CWG1AS0_SHUTDOWN_LENGTH                  equ 0001h
CWG1AS0_SHUTDOWN_MASK                    equ 0080h
CWG1AS0_LSAC0_POSN                       equ 0002h
CWG1AS0_LSAC0_POSITION                   equ 0002h
CWG1AS0_LSAC0_SIZE                       equ 0001h
CWG1AS0_LSAC0_LENGTH                     equ 0001h
CWG1AS0_LSAC0_MASK                       equ 0004h
CWG1AS0_LSCA1_POSN                       equ 0003h
CWG1AS0_LSCA1_POSITION                   equ 0003h
CWG1AS0_LSCA1_SIZE                       equ 0001h
CWG1AS0_LSCA1_LENGTH                     equ 0001h
CWG1AS0_LSCA1_MASK                       equ 0008h
CWG1AS0_LSDB0_POSN                       equ 0004h
CWG1AS0_LSDB0_POSITION                   equ 0004h
CWG1AS0_LSDB0_SIZE                       equ 0001h
CWG1AS0_LSDB0_LENGTH                     equ 0001h
CWG1AS0_LSDB0_MASK                       equ 0010h
CWG1AS0_LSDB1_POSN                       equ 0005h
CWG1AS0_LSDB1_POSITION                   equ 0005h
CWG1AS0_LSDB1_SIZE                       equ 0001h
CWG1AS0_LSDB1_LENGTH                     equ 0001h
CWG1AS0_LSDB1_MASK                       equ 0020h
CWG1AS0_CWG1LSAC0_POSN                   equ 0002h
CWG1AS0_CWG1LSAC0_POSITION               equ 0002h
CWG1AS0_CWG1LSAC0_SIZE                   equ 0001h
CWG1AS0_CWG1LSAC0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSAC0_MASK                   equ 0004h
CWG1AS0_CWG1LSAC1_POSN                   equ 0003h
CWG1AS0_CWG1LSAC1_POSITION               equ 0003h
CWG1AS0_CWG1LSAC1_SIZE                   equ 0001h
CWG1AS0_CWG1LSAC1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSAC1_MASK                   equ 0008h
CWG1AS0_CWG1LSDB0_POSN                   equ 0004h
CWG1AS0_CWG1LSDB0_POSITION               equ 0004h
CWG1AS0_CWG1LSDB0_SIZE                   equ 0001h
CWG1AS0_CWG1LSDB0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSDB0_MASK                   equ 0010h
CWG1AS0_CWG1LSDB1_POSN                   equ 0005h
CWG1AS0_CWG1LSDB1_POSITION               equ 0005h
CWG1AS0_CWG1LSDB1_SIZE                   equ 0001h
CWG1AS0_CWG1LSDB1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSDB1_MASK                   equ 0020h
CWG1AS0_CWG1LSAC_POSN                    equ 0002h
CWG1AS0_CWG1LSAC_POSITION                equ 0002h
CWG1AS0_CWG1LSAC_SIZE                    equ 0002h
CWG1AS0_CWG1LSAC_LENGTH                  equ 0002h
CWG1AS0_CWG1LSAC_MASK                    equ 000Ch
CWG1AS0_CWG1LSDB_POSN                    equ 0004h
CWG1AS0_CWG1LSDB_POSITION                equ 0004h
CWG1AS0_CWG1LSDB_SIZE                    equ 0002h
CWG1AS0_CWG1LSDB_LENGTH                  equ 0002h
CWG1AS0_CWG1LSDB_MASK                    equ 0030h
CWG1AS0_LSBD_POSN                        equ 0004h
CWG1AS0_LSBD_POSITION                    equ 0004h
CWG1AS0_LSBD_SIZE                        equ 0002h
CWG1AS0_LSBD_LENGTH                      equ 0002h
CWG1AS0_LSBD_MASK                        equ 0030h
CWG1AS0_LSAC1_POSN                       equ 0003h
CWG1AS0_LSAC1_POSITION                   equ 0003h
CWG1AS0_LSAC1_SIZE                       equ 0001h
CWG1AS0_LSAC1_LENGTH                     equ 0001h
CWG1AS0_LSAC1_MASK                       equ 0008h
CWG1AS0_LSBD0_POSN                       equ 0004h
CWG1AS0_LSBD0_POSITION                   equ 0004h
CWG1AS0_LSBD0_SIZE                       equ 0001h
CWG1AS0_LSBD0_LENGTH                     equ 0001h
CWG1AS0_LSBD0_MASK                       equ 0010h
CWG1AS0_LSBD1_POSN                       equ 0005h
CWG1AS0_LSBD1_POSITION                   equ 0005h
CWG1AS0_LSBD1_SIZE                       equ 0001h
CWG1AS0_LSBD1_LENGTH                     equ 0001h
CWG1AS0_LSBD1_MASK                       equ 0020h
CWG1AS0_CWG1LSBD0_POSN                   equ 0004h
CWG1AS0_CWG1LSBD0_POSITION               equ 0004h
CWG1AS0_CWG1LSBD0_SIZE                   equ 0001h
CWG1AS0_CWG1LSBD0_LENGTH                 equ 0001h
CWG1AS0_CWG1LSBD0_MASK                   equ 0010h
CWG1AS0_CWG1LSBD1_POSN                   equ 0005h
CWG1AS0_CWG1LSBD1_POSITION               equ 0005h
CWG1AS0_CWG1LSBD1_SIZE                   equ 0001h
CWG1AS0_CWG1LSBD1_LENGTH                 equ 0001h
CWG1AS0_CWG1LSBD1_MASK                   equ 0020h
CWG1AS0_CWG1LSBD_POSN                    equ 0004h
CWG1AS0_CWG1LSBD_POSITION                equ 0004h
CWG1AS0_CWG1LSBD_SIZE                    equ 0002h
CWG1AS0_CWG1LSBD_LENGTH                  equ 0002h
CWG1AS0_CWG1LSBD_MASK                    equ 0030h

// Register: CWG1AS1
#define CWG1AS1 CWG1AS1
CWG1AS1                                  equ 03F59h
// bitfield definitions
CWG1AS1_AS0E_POSN                        equ 0000h
CWG1AS1_AS0E_POSITION                    equ 0000h
CWG1AS1_AS0E_SIZE                        equ 0001h
CWG1AS1_AS0E_LENGTH                      equ 0001h
CWG1AS1_AS0E_MASK                        equ 0001h
CWG1AS1_AS1E_POSN                        equ 0001h
CWG1AS1_AS1E_POSITION                    equ 0001h
CWG1AS1_AS1E_SIZE                        equ 0001h
CWG1AS1_AS1E_LENGTH                      equ 0001h
CWG1AS1_AS1E_MASK                        equ 0002h
CWG1AS1_AS2E_POSN                        equ 0002h
CWG1AS1_AS2E_POSITION                    equ 0002h
CWG1AS1_AS2E_SIZE                        equ 0001h
CWG1AS1_AS2E_LENGTH                      equ 0001h
CWG1AS1_AS2E_MASK                        equ 0004h
CWG1AS1_AS3E_POSN                        equ 0003h
CWG1AS1_AS3E_POSITION                    equ 0003h
CWG1AS1_AS3E_SIZE                        equ 0001h
CWG1AS1_AS3E_LENGTH                      equ 0001h
CWG1AS1_AS3E_MASK                        equ 0008h
CWG1AS1_AS4E_POSN                        equ 0004h
CWG1AS1_AS4E_POSITION                    equ 0004h
CWG1AS1_AS4E_SIZE                        equ 0001h
CWG1AS1_AS4E_LENGTH                      equ 0001h
CWG1AS1_AS4E_MASK                        equ 0010h
CWG1AS1_AS5E_POSN                        equ 0005h
CWG1AS1_AS5E_POSITION                    equ 0005h
CWG1AS1_AS5E_SIZE                        equ 0001h
CWG1AS1_AS5E_LENGTH                      equ 0001h
CWG1AS1_AS5E_MASK                        equ 0020h
CWG1AS1_AS6E_POSN                        equ 0006h
CWG1AS1_AS6E_POSITION                    equ 0006h
CWG1AS1_AS6E_SIZE                        equ 0001h
CWG1AS1_AS6E_LENGTH                      equ 0001h
CWG1AS1_AS6E_MASK                        equ 0040h

// Register: CWG1STR
#define CWG1STR CWG1STR
CWG1STR                                  equ 03F5Ah
// bitfield definitions
CWG1STR_STRA_POSN                        equ 0000h
CWG1STR_STRA_POSITION                    equ 0000h
CWG1STR_STRA_SIZE                        equ 0001h
CWG1STR_STRA_LENGTH                      equ 0001h
CWG1STR_STRA_MASK                        equ 0001h
CWG1STR_STRB_POSN                        equ 0001h
CWG1STR_STRB_POSITION                    equ 0001h
CWG1STR_STRB_SIZE                        equ 0001h
CWG1STR_STRB_LENGTH                      equ 0001h
CWG1STR_STRB_MASK                        equ 0002h
CWG1STR_STRC_POSN                        equ 0002h
CWG1STR_STRC_POSITION                    equ 0002h
CWG1STR_STRC_SIZE                        equ 0001h
CWG1STR_STRC_LENGTH                      equ 0001h
CWG1STR_STRC_MASK                        equ 0004h
CWG1STR_STRD_POSN                        equ 0003h
CWG1STR_STRD_POSITION                    equ 0003h
CWG1STR_STRD_SIZE                        equ 0001h
CWG1STR_STRD_LENGTH                      equ 0001h
CWG1STR_STRD_MASK                        equ 0008h
CWG1STR_OVRA_POSN                        equ 0004h
CWG1STR_OVRA_POSITION                    equ 0004h
CWG1STR_OVRA_SIZE                        equ 0001h
CWG1STR_OVRA_LENGTH                      equ 0001h
CWG1STR_OVRA_MASK                        equ 0010h
CWG1STR_OVRB_POSN                        equ 0005h
CWG1STR_OVRB_POSITION                    equ 0005h
CWG1STR_OVRB_SIZE                        equ 0001h
CWG1STR_OVRB_LENGTH                      equ 0001h
CWG1STR_OVRB_MASK                        equ 0020h
CWG1STR_OVRC_POSN                        equ 0006h
CWG1STR_OVRC_POSITION                    equ 0006h
CWG1STR_OVRC_SIZE                        equ 0001h
CWG1STR_OVRC_LENGTH                      equ 0001h
CWG1STR_OVRC_MASK                        equ 0040h
CWG1STR_OVRD_POSN                        equ 0007h
CWG1STR_OVRD_POSITION                    equ 0007h
CWG1STR_OVRD_SIZE                        equ 0001h
CWG1STR_OVRD_LENGTH                      equ 0001h
CWG1STR_OVRD_MASK                        equ 0080h
CWG1STR_CWG1STRA_POSN                    equ 0000h
CWG1STR_CWG1STRA_POSITION                equ 0000h
CWG1STR_CWG1STRA_SIZE                    equ 0001h
CWG1STR_CWG1STRA_LENGTH                  equ 0001h
CWG1STR_CWG1STRA_MASK                    equ 0001h
CWG1STR_CWG1STRB_POSN                    equ 0001h
CWG1STR_CWG1STRB_POSITION                equ 0001h
CWG1STR_CWG1STRB_SIZE                    equ 0001h
CWG1STR_CWG1STRB_LENGTH                  equ 0001h
CWG1STR_CWG1STRB_MASK                    equ 0002h
CWG1STR_CWG1STRC_POSN                    equ 0002h
CWG1STR_CWG1STRC_POSITION                equ 0002h
CWG1STR_CWG1STRC_SIZE                    equ 0001h
CWG1STR_CWG1STRC_LENGTH                  equ 0001h
CWG1STR_CWG1STRC_MASK                    equ 0004h
CWG1STR_CWG1STRD_POSN                    equ 0003h
CWG1STR_CWG1STRD_POSITION                equ 0003h
CWG1STR_CWG1STRD_SIZE                    equ 0001h
CWG1STR_CWG1STRD_LENGTH                  equ 0001h
CWG1STR_CWG1STRD_MASK                    equ 0008h
CWG1STR_CWG1OVRA_POSN                    equ 0004h
CWG1STR_CWG1OVRA_POSITION                equ 0004h
CWG1STR_CWG1OVRA_SIZE                    equ 0001h
CWG1STR_CWG1OVRA_LENGTH                  equ 0001h
CWG1STR_CWG1OVRA_MASK                    equ 0010h
CWG1STR_CWG1OVRB_POSN                    equ 0005h
CWG1STR_CWG1OVRB_POSITION                equ 0005h
CWG1STR_CWG1OVRB_SIZE                    equ 0001h
CWG1STR_CWG1OVRB_LENGTH                  equ 0001h
CWG1STR_CWG1OVRB_MASK                    equ 0020h
CWG1STR_CWG1OVRC_POSN                    equ 0006h
CWG1STR_CWG1OVRC_POSITION                equ 0006h
CWG1STR_CWG1OVRC_SIZE                    equ 0001h
CWG1STR_CWG1OVRC_LENGTH                  equ 0001h
CWG1STR_CWG1OVRC_MASK                    equ 0040h
CWG1STR_CWG1OVRD_POSN                    equ 0007h
CWG1STR_CWG1OVRD_POSITION                equ 0007h
CWG1STR_CWG1OVRD_SIZE                    equ 0001h
CWG1STR_CWG1OVRD_LENGTH                  equ 0001h
CWG1STR_CWG1OVRD_MASK                    equ 0080h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 03F5Eh
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch
CCPTMRS0_C3TSEL_POSN                     equ 0004h
CCPTMRS0_C3TSEL_POSITION                 equ 0004h
CCPTMRS0_C3TSEL_SIZE                     equ 0002h
CCPTMRS0_C3TSEL_LENGTH                   equ 0002h
CCPTMRS0_C3TSEL_MASK                     equ 0030h
CCPTMRS0_C4TSEL_POSN                     equ 0006h
CCPTMRS0_C4TSEL_POSITION                 equ 0006h
CCPTMRS0_C4TSEL_SIZE                     equ 0002h
CCPTMRS0_C4TSEL_LENGTH                   equ 0002h
CCPTMRS0_C4TSEL_MASK                     equ 00C0h
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C2TSEL0_POSN                    equ 0002h
CCPTMRS0_C2TSEL0_POSITION                equ 0002h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0004h
CCPTMRS0_C2TSEL1_POSN                    equ 0003h
CCPTMRS0_C2TSEL1_POSITION                equ 0003h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0008h
CCPTMRS0_C3TSEL0_POSN                    equ 0004h
CCPTMRS0_C3TSEL0_POSITION                equ 0004h
CCPTMRS0_C3TSEL0_SIZE                    equ 0001h
CCPTMRS0_C3TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL0_MASK                    equ 0010h
CCPTMRS0_C3TSEL1_POSN                    equ 0005h
CCPTMRS0_C3TSEL1_POSITION                equ 0005h
CCPTMRS0_C3TSEL1_SIZE                    equ 0001h
CCPTMRS0_C3TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL1_MASK                    equ 0020h
CCPTMRS0_C4TSEL0_POSN                    equ 0006h
CCPTMRS0_C4TSEL0_POSITION                equ 0006h
CCPTMRS0_C4TSEL0_SIZE                    equ 0001h
CCPTMRS0_C4TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C4TSEL0_MASK                    equ 0040h
CCPTMRS0_C4TSEL1_POSN                    equ 0007h
CCPTMRS0_C4TSEL1_POSITION                equ 0007h
CCPTMRS0_C4TSEL1_SIZE                    equ 0001h
CCPTMRS0_C4TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C4TSEL1_MASK                    equ 0080h

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
CCPTMRS1                                 equ 03F5Fh
// bitfield definitions
CCPTMRS1_P5TSEL_POSN                     equ 0000h
CCPTMRS1_P5TSEL_POSITION                 equ 0000h
CCPTMRS1_P5TSEL_SIZE                     equ 0002h
CCPTMRS1_P5TSEL_LENGTH                   equ 0002h
CCPTMRS1_P5TSEL_MASK                     equ 0003h
CCPTMRS1_P6TSEL_POSN                     equ 0002h
CCPTMRS1_P6TSEL_POSITION                 equ 0002h
CCPTMRS1_P6TSEL_SIZE                     equ 0002h
CCPTMRS1_P6TSEL_LENGTH                   equ 0002h
CCPTMRS1_P6TSEL_MASK                     equ 000Ch
CCPTMRS1_P7TSEL_POSN                     equ 0004h
CCPTMRS1_P7TSEL_POSITION                 equ 0004h
CCPTMRS1_P7TSEL_SIZE                     equ 0002h
CCPTMRS1_P7TSEL_LENGTH                   equ 0002h
CCPTMRS1_P7TSEL_MASK                     equ 0030h
CCPTMRS1_P8TSEL_POSN                     equ 0006h
CCPTMRS1_P8TSEL_POSITION                 equ 0006h
CCPTMRS1_P8TSEL_SIZE                     equ 0002h
CCPTMRS1_P8TSEL_LENGTH                   equ 0002h
CCPTMRS1_P8TSEL_MASK                     equ 00C0h
CCPTMRS1_P5TSEL0_POSN                    equ 0000h
CCPTMRS1_P5TSEL0_POSITION                equ 0000h
CCPTMRS1_P5TSEL0_SIZE                    equ 0001h
CCPTMRS1_P5TSEL0_LENGTH                  equ 0001h
CCPTMRS1_P5TSEL0_MASK                    equ 0001h
CCPTMRS1_P5TSEL1_POSN                    equ 0001h
CCPTMRS1_P5TSEL1_POSITION                equ 0001h
CCPTMRS1_P5TSEL1_SIZE                    equ 0001h
CCPTMRS1_P5TSEL1_LENGTH                  equ 0001h
CCPTMRS1_P5TSEL1_MASK                    equ 0002h
CCPTMRS1_P6TSEL0_POSN                    equ 0002h
CCPTMRS1_P6TSEL0_POSITION                equ 0002h
CCPTMRS1_P6TSEL0_SIZE                    equ 0001h
CCPTMRS1_P6TSEL0_LENGTH                  equ 0001h
CCPTMRS1_P6TSEL0_MASK                    equ 0004h
CCPTMRS1_P6TSEL1_POSN                    equ 0003h
CCPTMRS1_P6TSEL1_POSITION                equ 0003h
CCPTMRS1_P6TSEL1_SIZE                    equ 0001h
CCPTMRS1_P6TSEL1_LENGTH                  equ 0001h
CCPTMRS1_P6TSEL1_MASK                    equ 0008h
CCPTMRS1_P7TSEL0_POSN                    equ 0004h
CCPTMRS1_P7TSEL0_POSITION                equ 0004h
CCPTMRS1_P7TSEL0_SIZE                    equ 0001h
CCPTMRS1_P7TSEL0_LENGTH                  equ 0001h
CCPTMRS1_P7TSEL0_MASK                    equ 0010h
CCPTMRS1_P7TSEL1_POSN                    equ 0005h
CCPTMRS1_P7TSEL1_POSITION                equ 0005h
CCPTMRS1_P7TSEL1_SIZE                    equ 0001h
CCPTMRS1_P7TSEL1_LENGTH                  equ 0001h
CCPTMRS1_P7TSEL1_MASK                    equ 0020h
CCPTMRS1_P8TSEL0_POSN                    equ 0006h
CCPTMRS1_P8TSEL0_POSITION                equ 0006h
CCPTMRS1_P8TSEL0_SIZE                    equ 0001h
CCPTMRS1_P8TSEL0_LENGTH                  equ 0001h
CCPTMRS1_P8TSEL0_MASK                    equ 0040h
CCPTMRS1_P8TSEL1_POSN                    equ 0007h
CCPTMRS1_P8TSEL1_POSITION                equ 0007h
CCPTMRS1_P8TSEL1_SIZE                    equ 0001h
CCPTMRS1_P8TSEL1_LENGTH                  equ 0001h
CCPTMRS1_P8TSEL1_MASK                    equ 0080h

// Register: PWM8DC
#define PWM8DC PWM8DC
PWM8DC                                   equ 03F60h

// Register: PWM8DCL
#define PWM8DCL PWM8DCL
PWM8DCL                                  equ 03F60h
// bitfield definitions
PWM8DCL_DC_POSN                          equ 0006h
PWM8DCL_DC_POSITION                      equ 0006h
PWM8DCL_DC_SIZE                          equ 0002h
PWM8DCL_DC_LENGTH                        equ 0002h
PWM8DCL_DC_MASK                          equ 00C0h
PWM8DCL_DC0_POSN                         equ 0006h
PWM8DCL_DC0_POSITION                     equ 0006h
PWM8DCL_DC0_SIZE                         equ 0001h
PWM8DCL_DC0_LENGTH                       equ 0001h
PWM8DCL_DC0_MASK                         equ 0040h
PWM8DCL_DC1_POSN                         equ 0007h
PWM8DCL_DC1_POSITION                     equ 0007h
PWM8DCL_DC1_SIZE                         equ 0001h
PWM8DCL_DC1_LENGTH                       equ 0001h
PWM8DCL_DC1_MASK                         equ 0080h
PWM8DCL_PWM8DC0_POSN                     equ 0006h
PWM8DCL_PWM8DC0_POSITION                 equ 0006h
PWM8DCL_PWM8DC0_SIZE                     equ 0001h
PWM8DCL_PWM8DC0_LENGTH                   equ 0001h
PWM8DCL_PWM8DC0_MASK                     equ 0040h
PWM8DCL_PWM8DC1_POSN                     equ 0007h
PWM8DCL_PWM8DC1_POSITION                 equ 0007h
PWM8DCL_PWM8DC1_SIZE                     equ 0001h
PWM8DCL_PWM8DC1_LENGTH                   equ 0001h
PWM8DCL_PWM8DC1_MASK                     equ 0080h
PWM8DCL_PWMPW0_POSN                      equ 0006h
PWM8DCL_PWMPW0_POSITION                  equ 0006h
PWM8DCL_PWMPW0_SIZE                      equ 0001h
PWM8DCL_PWMPW0_LENGTH                    equ 0001h
PWM8DCL_PWMPW0_MASK                      equ 0040h
PWM8DCL_PWMPW1_POSN                      equ 0007h
PWM8DCL_PWMPW1_POSITION                  equ 0007h
PWM8DCL_PWMPW1_SIZE                      equ 0001h
PWM8DCL_PWMPW1_LENGTH                    equ 0001h
PWM8DCL_PWMPW1_MASK                      equ 0080h

